{"config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "dtype": "float32", "data_format": "channels_last", "kernel_size": [3, 3], "activation": "relu", "name": "conv2d_3", "batch_input_shape": [null, 32, 32, 3], "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "activation": "relu", "name": "conv2d_4", "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_3", "activation": "relu", "units": 128, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_4", "activation": "sigmoid", "units": 12, "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.2.0", "class_name": "Sequential"}